released/M480BSP_HSUSBD_HID_MultiDevice/SampleCode/Template/kb_mouse.c
    len = HSUSBD->EP[EPB].EPDATCNT & 0xffff;

    for (i = 0; i < len; i++) {
        g_u8EPBOutBuff[i] = HSUSBD->EP[EPB].EPDAT_BYTE;
        printf("0x%02x ", g_u8EPBOutBuff[i]);
    }
    printf("\r\n");
}

//
// EPC_Handler
//
void EPC_Handler(void)
{
    g_u8EPCReady = 1;
}

//
// EPD_Handler
//
void EPD_Handler(void)
{
    g_u8EPDReady = 1;
}

//
// EPE_Handler
//
void EPE_Handler(void)
{
    g_u8EPEReady = 1;
}

//
// EPF_Handler
//
void EPF_Handler(void)
{
    uint32_t len, i;
    
    len = HSUSBD->EP[EPF].EPDATCNT & 0xffff;

    for (i = 0; i < len; i++) {
        g_u8EPFOutBuff[i] = HSUSBD->EP[EPF].EPDAT_BYTE;
        printf("0x%02x ", g_u8EPFOutBuff[i]);
    }
    printf("\r\n");
}


//
// remoteWakeupProcess
//
void HID_RemoteWakeupProcess(void)
{
    if (g_hsusbd_RemoteWakeupEn) {
        if (bIsPressKey) {
            bIsPressKey = 0;
            printf("Remote wake-up\r\n");
            if ((HSUSBD->OPER & HSUSBD_OPER_RESUMEEN_Msk) != 1) {
                HSUSBD->OPER |= HSUSBD_OPER_RESUMEEN_Msk;
                while(HSUSBD->OPER & HSUSBD_OPER_RESUMEEN_Msk);
            }
        }
    }
}

//
// HID_powerDownHandler
//
void HID_powerDownHandler(void)
{  
    if (g_u8suspend)
    {
        //
        // Perform remote wake-up
        //
        HID_RemoteWakeupProcess();
    }
}

void HID_UpdateKeyboardData(void)
{
    static uint8_t epa_test_count = 0;
    int volatile i;
    const uint8_t len = 4;
    uint8_t epa_buf[len] = {0};

    if (g_u8EPAReady) {

        for(i = 0; i < len; i++)
            epa_buf[i] = 0;

        /* Update new report data */
        epa_buf[0] = 0x00;
        epa_buf[1] = 0x00;
        epa_buf[2] = 0x00;
        epa_buf[3] = epa_test_count++;
        g_u8EPAReady = 0;
        
        /* Set transfer length and trigger IN transfer */
        for (i = 0; i < len; i++) {
            HSUSBD->EP[EPA].EPDAT_BYTE = epa_buf[i];
        }

        HSUSBD->EP[EPA].EPRSPCTL = HSUSBD_EP_RSPCTL_SHORTTXEN;
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_INTKIEN_Msk);

        printf("g_u8EPAReady\r\n");
    }    
}


void HID_UpdateMouseData(void)
{
    int volatile i;    
    const uint8_t len = 4;
    uint8_t epc_buf[len] = {0};

    if (g_u8EPCReady) {
        
        for(i = 0; i < len; i++)
            epc_buf[i] = 0;

        /* Update new report data */
        epc_buf[0] = 0x00;
        epc_buf[1] = 0x00;
        epc_buf[2] = 0x00;
        epc_buf[3] = 0x00;
        g_u8EPCReady = 0;
        
        /* Set transfer length and trigger IN transfer */
        for (i = 0; i < len; i++) {
            HSUSBD->EP[EPC].EPDAT_BYTE = epc_buf[i];
        }

        HSUSBD->EP[EPC].EPRSPCTL = HSUSBD_EP_RSPCTL_SHORTTXEN;
        HSUSBD_ENABLE_EP_INT(EPC, HSUSBD_EPINTEN_INTKIEN_Msk);

        printf("g_u8EPCReady\r\n");
    }
}

//
// HID_Handler
//
void HID_Handler(void)
{
    uint32_t len = 0;
    static uint8_t epd_test_count = 0;
    static uint8_t epe_test_count = 0;

    uint8_t epd_buf[EPD_MAX_PKT_SIZE] = {0};
    uint8_t epe_buf[EPE_MAX_PKT_SIZE] = {0};

    int volatile i;

    HID_powerDownHandler();
    HID_UpdateKeyboardData();
    HID_UpdateMouseData();
    
    if (g_u8EPDReady) {

         /* Update new report data */
        epd_buf[0] = 0xD0;
        epd_buf[1] = 0xD1;
        epd_buf[2] = 0xD2;
        epd_buf[3] = epd_test_count++;
        g_u8EPDReady = 0;
        
        len = g_u32EpDMaxPacketSize;
        /* Set transfer length and trigger IN transfer */
        for (i = 0; i < 4; i++) {
            // check REPORT_COUNT
            HSUSBD->EP[EPD].EPDAT_BYTE = epd_buf[i];
        }

        HSUSBD->EP[EPD].EPRSPCTL = HSUSBD_EP_RSPCTL_SHORTTXEN;
        HSUSBD->EP[EPD].EPTXCNT = len;
        HSUSBD_ENABLE_EP_INT(EPD, HSUSBD_EPINTEN_INTKIEN_Msk);

        printf("g_u8EPDReady\r\n");
    }
    
    if (g_u8EPEReady) {
        /* Update new report data */
        epe_buf[0] = 0xE0;
        epe_buf[1] = 0xE1;
        epe_buf[2] = 0xE2;
        epe_buf[3] = epe_test_count++;
        g_u8EPEReady = 0;
                
        len = g_u32EpEMaxPacketSize;
        /* Set transfer length and trigger IN transfer */
        for (i = 0; i < 4; i++) {
            // check REPORT_COUNT
            HSUSBD->EP[EPE].EPDAT_BYTE = epe_buf[i];
        }

        HSUSBD->EP[EPE].EPRSPCTL = HSUSBD_EP_RSPCTL_SHORTTXEN;
        HSUSBD->EP[EPE].EPTXCNT = len;
        HSUSBD_ENABLE_EP_INT(EPE, HSUSBD_EPINTEN_INTKIEN_Msk);

        printf("g_u8EPEReady\r\n");
    }    

}
